_Rarzrabotki/Rarus/USO2/Reports/уатКарточкаРаботыАвтомобильнойШины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>уатКарточкаРаботыАвтомобильнойШины</Name>
			<Comment>Карточка работы автомобильной шины</Comment>
		</Properties>
	</Report>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатАгрегатыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатАгрегатыТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Comment>Первоначальная стоимость агрегата</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта первоначальной стоимости</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроизводстваШины</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокСлужбыШины</Name>
					<Comment>Срок службы, мес.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелОбъектаЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатУстановленныеАгрегаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатУстановленныеАгрегаты</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеАгрегата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСостоянияАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМестаУстановкиШин</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелОбъектаЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатМестонахождениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатМестонахождениеТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/уатИзносПробегШин.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>уатИзносПробегШин</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Пробег, км</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Износ</Name>
					<Comment>Износ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелОбъектаЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатСостоянияАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатСостоянияАгрегатов</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановленоВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленоВЗапас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Снято</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Reports/уатКарточкаРаботыАвтомобильнойШины/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаКон = НачалоМесяца(ТекущаяДата())-1;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.ТекущийПользователь(), 
			"ОсновнаяОрганизация"
		);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШинаПриИзменении(Элемент)
	
	ПриИзмененииШиныСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ШинаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ТипАгрегата, РежимВыбора", "Шина", Истина);
	ОткрытьФорму("РегистрСведений.уатАгрегатыТС.ФормаСписка", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ШинаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("РегистрСведенийКлючЗаписи.уатАгрегатыТС") Тогда
		СтандартнаяОбработка = Ложь;
		Шина = ВыбАгрегатСервер(ВыбранноеЗначение);
		ПриИзмененииШиныСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШинаОткрытие(Элемент, СтандартнаяОбработка)
	
	КлючЗаписи = ПолучитьКлючАгрегата(Шина);
	Если КлючЗаписи <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
		ОткрытьФорму("РегистрСведений.уатАгрегатыТС.ФормаЗаписи", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ЗначениеЗаполнено(Шина) Тогда
		Если НЕ ЗначениеЗаполнено(СерийныйНомер) Тогда
			ПоказатьПредупреждение(, "Не указана шина!", 10);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТабДок = СформироватьОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//  ДокументРезультат - табличный документ, формируемый отчетом
//
&НаСервере
Функция СформироватьОтчет() Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ЗапросУстановкаСнятие = Новый Запрос();
	
	ЗапросУстановкаСнятие.Текст =
	"ВЫБРАТЬ
	|	УстановленоНаТС.Период КАК ДатаУстановкиШиныНаТС,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаСнятияШиныСТС,
	|	УстановленоНаТС.УзелОбъектаЭксплуатации КАК Шины,
	|	УстановленоНаТС.ТранспортноеСредство КАК ТС,
	|	УстановленоНаТС.ТранспортноеСредство.уатМодель КАК МодельТС,
	|	УстановленоНаТС.ТранспортноеСредство.уатГаражныйНомер КАК ИнвНомерТС,
	|	УстановленоНаТС.ТранспортноеСредство.Код КАК ГосударственныйНомер,
	|	УстановленоНаТС.МестоУстановки КАК МестоУстановки
	|ИЗ
	|	РегистрСведений.уатУстановленныеАгрегаты КАК УстановленоНаТС
	|ГДЕ
	|	УстановленоНаТС.СостояниеАгрегата = ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.УстановленоВРаботе)";
	
	Если ЗначениеЗаполнено(Шина) Тогда
		ЗапросУстановкаСнятие.УстановитьПараметр("Шина", Шина);
		ЗапросУстановкаСнятие.Текст = ЗапросУстановкаСнятие.Текст + "
		| И УстановленоНаТС.УзелОбъектаЭксплуатации = &Шина";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		ЗапросУстановкаСнятие.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
		ЗапросУстановкаСнятие.Текст = ЗапросУстановкаСнятие.Текст + "
		| И УстановленоНаТС.УзелОбъектаЭксплуатации.СерийныйНомер = &СерийныйНомер";
	КонецЕсли;
	
	ЗапросУстановкаСнятие.Текст = ЗапросУстановкаСнятие.Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СнятоСТС.Период КАК ДатаСнятияШиныСТС,
	|	СнятоСТС.УзелОбъектаЭксплуатации КАК Шины,
	|	СнятоСТС.ТранспортноеСредство КАК ТС,
	|	СнятоСТС.МестоУстановки КАК МестоУстановки
	|ИЗ
	|	РегистрСведений.уатУстановленныеАгрегаты КАК СнятоСТС
	|ГДЕ
	|	СнятоСТС.СостояниеАгрегата = ЗНАЧЕНИЕ(Перечисление.уатСостоянияАгрегатов.Снято)";
	
	Если ЗначениеЗаполнено(Шина) Тогда
		ЗапросУстановкаСнятие.Текст = ЗапросУстановкаСнятие.Текст + "
		| И СнятоСТС.УзелОбъектаЭксплуатации = &Шина";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		ЗапросУстановкаСнятие.Текст = ЗапросУстановкаСнятие.Текст + "
		| И СнятоСТС.УзелОбъектаЭксплуатации.СерийныйНомер = &СерийныйНомер";
	КонецЕсли;
	
	мсвРезультаты = ЗапросУстановкаСнятие.ВыполнитьПакет();
	
	ТабУстановки = мсвРезультаты[0].Выгрузить();
	ТабСнятия    = мсвРезультаты[1].Выгрузить();
	
	ФлагОбщаяМодель			 = Истина;
	ФлагОбщееНаименование	 = Истина;
	НомерСторки				 = 1;
	МодельШины				 = Шина.Модель;
	ОбозначениеШины			 = "";
	мШина					 = Новый Массив();
	
	Для Каждого ТекСтрока Из ТабУстановки Цикл 
		
		ФлагОбщаяМодель			 = ТекСтрока.СерияНоменклатурыМодель = МодельШины ИЛИ НомерСторки = 1;
		ФлагОбщееНаименование	 = ТекСтрока.СерияНоменклатурыНаименование = ОбозначениеШины ИЛИ НомерСторки = 1;
		МодельШины				 = ТекСтрока.СерияНоменклатурыМодель;
		ОбозначениеШины			 = ТекСтрока.СерияНоменклатурыНаименование;
		мШина.Добавить(ТекСтрока.Шины);

		НайдСтроки = ТабСнятия.НайтиСтроки(Новый Структура("ТС,МестоУстановки",ТекСтрока.ТС,ТекСтрока.МестоУстановки));
		Если НайдСтроки.Количество() Тогда 
			Для Каждого СтрокаСнятия Из НайдСтроки Цикл 
				Если СтрокаСнятия.ДатаСнятияШиныСТС >= ТекСтрока.ДатаУстановкиШиныНаТС Тогда 
					ТекСтрока.ДатаСнятияШиныСТС = СтрокаСнятия.ДатаСнятияШиныСТС;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		НомерСторки = НомерСторки + 1;
	КонецЦикла;
	
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	Шапка = Макет.ПолучитьОбласть("Заголовок");

	Шапка.Параметры.НазваниеОрганизации = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Организация, ДатаКон),
		"ПолноеНаименование, ЮридическийАдрес, Телефоны");
		
	Шапка.Параметры.Шина				= Шина;
	
	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		Шапка.Параметры.СерийныйномерШины	= СерийныйНомер;
	Иначе
		Шапка.Параметры.СерийныйномерШины	= Шина.СерийныйНомер;
	КонецЕсли;
	
	ЗапроспоШине= новый запрос;
	ЗапросПоШине.Текст = 
	"ВЫБРАТЬ
	|	уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.уатУстановленныеАгрегаты.СрезПоследних(&Дата, ) КАК уатУстановленныеАгрегатыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатМестонахождениеТС.СрезПоследних(&Дата, ) КАК уатМестонахождениеТССрезПоследних
	|		ПО уатУстановленныеАгрегатыСрезПоследних.ТранспортноеСредство = уатМестонахождениеТССрезПоследних.ТС
	|ГДЕ
	|	уатУстановленныеАгрегатыСрезПоследних.УзелОбъектаЭксплуатации В(&УзелОбъектаЭксплуатации)
	|
	|УПОРЯДОЧИТЬ ПО
	|	уатМестонахождениеТССрезПоследних.Период УБЫВ";
	ЗапроспоШине.УстановитьПараметр("УзелОбъектаЭксплуатации", ?(ФлагОбщаяМодель, мШина, Шина));

	ЗапроспоШине.УстановитьПараметр("Дата",                    ДатаКон);
	ВыборкаПоШине=ЗапроспоШине.Выполнить().Выбрать();
	Если ВыборкаПоШине.Следующий() Тогда
		Шапка.Параметры.НомерКолонны = ВыборкаПоШине.Подразделение;
	КонецЕсли;	
	
	//запрос по началу эксплуатации
	Если ЗначениеЗаполнено(Шина) ИЛИ ФлагОбщаяМодель Тогда
		ЗапросДатаПоступления = Новый Запрос(
		"ВЫБРАТЬ
		|	УзелОбъектаЭксплуатацииСрезПервых.Период,
		|	уатАгрегатыТС.МодельАгрегата,
		|	УзелОбъектаЭксплуатацииСрезПервых.УзелОбъектаЭксплуатации.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.уатУстановленныеАгрегаты.СрезПервых(, УзелОбъектаЭксплуатации В(&Шина)) КАК УзелОбъектаЭксплуатацииСрезПервых
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатАгрегатыТС КАК уатАгрегатыТС
		|		ПО УзелОбъектаЭксплуатацииСрезПервых.УзелОбъектаЭксплуатации = уатАгрегатыТС.УзелОбъектаЭксплуатации
		|
		|УПОРЯДОЧИТЬ ПО
		|	УзелОбъектаЭксплуатацииСрезПервых.Период");
		ЗапросДатаПоступления.Параметры.Вставить("Шина", мШина);
		ВыборкаДатаПоступления = ЗапросДатаПоступления.Выполнить().Выбрать();
		Если ВыборкаДатаПоступления.Следующий() Тогда
			Шапка.Параметры.ДатаПоступления = ВыборкаДатаПоступления.Период;
			Шапка.Параметры.МодельШины      = ВыборкаДатаПоступления.МодельАгрегата;
			Шапка.Параметры.Изготовитель    = ВыборкаДатаПоступления.МодельАгрегата.Производитель;
			Шапка.Параметры.ОбозначениеШины = ВыборкаДатаПоступления.Наименование;
		КонецЕсли;
	КонецЕсли;
	
	ДокументРезультат.Вывести(Шапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблШин.ДатаУстановкиШиныНаТС,
	|	ТаблШин.ДатаСнятияШиныСТС,
	|	ТаблШин.Шины,
	|	ТаблШин.ТС,
	|	ТаблШин.МодельТС,
	|	ТаблШин.ИнвНомерТС,
	|	ТаблШин.ГосударственныйНомер,
	|	ТаблШин.МестоУстановки
	|ПОМЕСТИТЬ ВРТ
	|ИЗ
	|	&ТаблШин КАК ТаблШин
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПробегЗаМесяц.ПробегОборот, 0) КАК ПробегЗаМесяц,
	|	ЕСТЬNULL(ОбщийПробег.ПробегОборот, 0) КАК ПробегОбщий,
	|	УстановленныеШины.ТС,
	|	УстановленныеШины.МодельТС,
	|	УстановленныеШины.ДатаУстановкиШиныНаТС,
	|	УстановленныеШины.ДатаСнятияШиныСТС,
	|	УстановленныеШины.ИнвНомерТС,
	|	УстановленныеШины.ГосударственныйНомер
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВРТ.ДатаУстановкиШиныНаТС КАК ДатаУстановкиШиныНаТС,
	|		ВРТ.Шины КАК Шины,
	|		ВРТ.ДатаСнятияШиныСТС КАК ДатаСнятияШиныСТС,
	|		ВРТ.ТС КАК ТС,
	|		ВРТ.МодельТС КАК МодельТС,
	|		ВРТ.ИнвНомерТС КАК ИнвНомерТС,
	|		ВРТ.ГосударственныйНомер КАК ГосударственныйНомер
	|	ИЗ
	|		ВРТ КАК ВРТ) КАК УстановленныеШины
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уатИзносПробегШинОбороты.ТС КАК ТС,
	|			уатИзносПробегШинОбороты.УзелОбъектаЭксплуатации КАК УзелОбъектаЭксплуатации,
	|			уатИзносПробегШинОбороты.Организация КАК Организация,
	|			СУММА(уатИзносПробегШинОбороты.ПробегОборот) КАК ПробегОборот
	|		ИЗ
	|			РегистрНакопления.уатИзносПробегШин.Обороты(НАЧАЛОПЕРИОДА(&ДатаКон, МЕСЯЦ), &ДатаКон, Регистратор, ";
	
	Если ЗначениеЗаполнено(Шина) Тогда
		Запрос.Параметры.Вставить("Шина", Шина);
		Запрос.Текст = Запрос.Текст + "УзелОбъектаЭксплуатации = &Шина";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		Запрос.Параметры.Вставить("СерийныйНомер", СерийныйНомер);
		Запрос.Текст = Запрос.Текст +
		?(ЗначениеЗаполнено(Шина), " И ", "") + "УзелОбъектаЭксплуатации.СерийныйНомер = &СерийныйНомер";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст +") КАК уатИзносПробегШинОбороты";
	Запрос.Текст = Запрос.Текст + "
	|		
	|		СГРУППИРОВАТЬ ПО
	|			уатИзносПробегШинОбороты.ТС,
	|			уатИзносПробегШинОбороты.Организация,
	|			уатИзносПробегШинОбороты.УзелОбъектаЭксплуатации) КАК ПробегЗаМесяц
	|		ПО УстановленныеШины.Шины = ПробегЗаМесяц.УзелОбъектаЭксплуатации
	|			И УстановленныеШины.ТС = ПробегЗаМесяц.ТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уатИзносПробегШинОбороты.ТС КАК ТС,
	|			уатИзносПробегШинОбороты.УзелОбъектаЭксплуатации КАК УзелОбъектаЭксплуатации,
	|			уатИзносПробегШинОбороты.Организация КАК Организация,
	|			СУММА(уатИзносПробегШинОбороты.ПробегОборот) КАК ПробегОборот
	|		ИЗ
	|			РегистрНакопления.уатИзносПробегШин.Обороты(, &ДатаКон, Регистратор, ";
	
	Если ЗначениеЗаполнено(Шина) Тогда
		Запрос.Текст = Запрос.Текст + "УзелОбъектаЭксплуатации = &Шина";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		Запрос.Текст = Запрос.Текст +
		?(ЗначениеЗаполнено(Шина), " И ", "") + "УзелОбъектаЭксплуатации.СерийныйНомер = &СерийныйНомер";
	КонецЕсли;	
	Запрос.Текст = Запрос.Текст +") КАК уатИзносПробегШинОбороты";
	Запрос.Текст = Запрос.Текст + " 
	|		
	|		СГРУППИРОВАТЬ ПО
	|			уатИзносПробегШинОбороты.ТС,
	|			уатИзносПробегШинОбороты.Организация,
	|			уатИзносПробегШинОбороты.УзелОбъектаЭксплуатации) КАК ОбщийПробег
	|		ПО УстановленныеШины.Шины = ОбщийПробег.УзелОбъектаЭксплуатации
	|			И УстановленныеШины.ТС = ОбщийПробег.ТС";
	
	Если ДатаКон <> '00010101000000' Тогда
		Запрос.Параметры.Вставить("ДатаКон", КонецМесяца(ДатаКон));
	Иначе
		Запрос.Параметры.Вставить("ДатаКон", КонецМесяца(ТекущаяДата()));
	КонецЕсли;
	Запрос.УстановитьПараметр("ТаблШин", ТабУстановки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗаголовокОтчета = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	
	ДокументРезультат.Вывести(ЗаголовокОтчета);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Строка = Макет.ПолучитьОбласть("Строка");
	
	Пока Выборка.Следующий() Цикл
		Строка.Параметры.Заполнить(Выборка);
		Строка.Параметры.ПредставлениеТС = Выборка.ГосударственныйНомер + ", " + Выборка.МодельТС + ", " + Выборка.ИнвНомерТС;
		Строка.Параметры.ТС = Выборка.ТС;
		Строка.Параметры.ПредставлениеПериода = Строка(Формат(ДатаКон, "ДФ=MM.yyyy")) + "г.";
		Строка.Параметры.ЗаМесяц = Выборка.ПробегЗаМесяц/1000;
		Строка.Параметры.ПробегОбщий = Выборка.ПробегОбщий/1000;
		ДокументРезультат.Вывести(Строка);
	КонецЦикла;	
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ДокументРезультат.Вывести(Подвал);
	
	// Ориентация страницы
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПолеСлева = 0;
	ДокументРезультат.ПолеСправа = 0;
	
	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = "Карточка работы шины";
	
	Возврат ДокументРезультат;
	
КонецФункции // СформироватьОтчет()

&НаСервереБезКонтекста
Функция ПолучитьКлючАгрегата(УзелОбъектаЭксплуатации)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("УзелОбъектаЭксплуатации", УзелОбъектаЭксплуатации);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	уатАгрегатыТС.УзелОбъектаЭксплуатации,
	|	уатАгрегатыТС.УдалитьТипАгрегата,
	|	уатАгрегатыТС.УдалитьСерияНоменклатуры,
	|	уатАгрегатыТС.УдалитьНоменклатура
	|ИЗ
	|	РегистрСведений.уатАгрегатыТС КАК уатАгрегатыТС
	|ГДЕ
	|	уатАгрегатыТС.УзелОбъектаЭксплуатации = &УзелОбъектаЭксплуатации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураКлюча = Новый Структура(
			"УзелОбъектаЭксплуатации, УдалитьТипАгрегата, УдалитьСерияНоменклатуры, УдалитьНоменклатура",
			Выборка.УзелОбъектаЭксплуатации, 
			Выборка.УдалитьТипАгрегата, 
			Выборка.УдалитьСерияНоменклатуры,
			Выборка.УдалитьНоменклатура
		);
		
		КлючЗаписи = РегистрыСведений.уатАгрегатыТС.СоздатьКлючЗаписи(СтруктураКлюча);
		
		Возврат КлючЗаписи;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииШиныСервер()
	
	НаименованиеШины = РегистрыСведений.уатАгрегатыТС.ПрочитатьРеквизитыАгрегата(Шина).Наименование;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыбАгрегатСервер(КлючЗаписи)
	
	Возврат КлючЗаписи.УзелОбъектаЭксплуатации;
	
КонецФункции

#КонецОбласти
